Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleColorSettingsType
Defines types for color settings of analysis display style.
Since:
2011
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleColorSettingsType.SolidColorRanges
Intermediate and min/max color settings define ranges in which the color is constant.

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleColorSettingsType.GradientColor
Intermediate and min/max color settings are used to interpolate color for values between adjacent entries.